/*******************************************************************************

                      版权所有 (C), 2023-2024, NCU_Roboteam

 *******************************************************************************
  文 件 名: PID.h
  版 本 号: V20240306.1
  作    者: 巢奖文
  生成日期: 2024年3月6日
  功能描述: PID控制函数库
  补    充: 无

*******************************************************************************/

/****************************头文件开头必备内容********************************/
#ifndef _PID_H
#define _PID_H

/********************************包含头文件************************************/
#include "math.h"

#include "arm_math.h"

#include "memory.h"
/*******************************文件内宏定义***********************************/

/*******************************文件内结构体***********************************/
/*PID控制参数结构体*/
typedef struct
{
	/*系数P*/
	float KP;

	/*系数I*/
	float KI;

	/*系数D*/
	float KD;
	
	/*前馈系数F*/
	float KF;

	/*当前误差*/
	float error_this_time;

	/*上一次误差*/
	float error_last_time;

	/*误差累加和*/
	float error_sum;


	/*I项限幅*/
	float I_SUM_limit;

	/*输出限幅*/
	float OUTPUT_limit;

	/*I项限幅使能标志*/
	int I_limit_flag;

	/*输出限幅使能标志*/
	int OUTPUT_limit_flag;


	/*计算输出*/
	float output;


	/*死区*/
	float dead_zone;

	/*死区使能标志*/
	int dead_zone_flag;
} PID;

/*******************************全局变量声明***********************************/

/********************************自定义函数************************************/
/**********************************************************************
  * @ 函数名  ： PID_count
  * @ 功能说明： PID闭环计算
  * @ 参数    ： PID *pid：PID控制参数结构体
								 float now：反馈值
								 float set：目标值
  * @ 返回值  ： PID计算输出值
	* @ 涉及变量： 无
  ********************************************************************/
float PID_count(PID *pid, float now, float set);

/**********************************************************************
  * @ 函数名  ： PID_reset
  * @ 功能说明： PID误差清空
  * @ 参数    ： PID *pid：PID控制参数结构体
  * @ 返回值  ： 无
	* @ 涉及变量： 无
  ********************************************************************/
void PID_reset(PID *pid);

#endif

/******************************** 文件结束 ************************************/
